// вибір конкретних елементів для застосування стилів
https://developer.chrome.com/articles/css-nth-child-of-s/ 
:nth-child(2): Виберіть другу дитину.
:nth-child(2n): Виберіть усіх парних дітей (2-й, 4-й, 6-й, 8-й і так далі) .
:nth-child(2n+1): Виберіть усіх непарних дітей (1-й, 3-й, 5-й, 7-й і так далі) .
:nth-child(5n+1): Виберіть 1-й (=(5×0)+1) , 6-й (=(5×1)+1) , 11-й (=(5×2)+1) , … дочірній елемент.
:nth-child(5n+2): виберіть 2-й (=(5×0)+2) , 7-й (=(5×1)+2) , 12-й (=(5×2)+2) , … дочірній елемент.

Наприклад, :nth-child(2 of .highlight)вибирає другий відповідний елемент, який має .highlightклас. Інакше: з усіх дітей класу .highlightвибрати другого.

Це, на відміну від .highlight:nth-child(2)цього, вибирає елемент, який має клас .highlight , а також є другим дочірнім елементом.