// вибір конкретних елементів для застосування стилів
https://developer.chrome.com/articles/css-nth-child-of-s/ 
:nth-child(2): Виберіть другу дитину.
:nth-child(2n): Виберіть усіх парних дітей (2-й, 4-й, 6-й, 8-й і так далі) .
:nth-child(2n+1): Виберіть усіх непарних дітей (1-й, 3-й, 5-й, 7-й і так далі) .
:nth-child(5n+1): Виберіть 1-й (=(5×0)+1) , 6-й (=(5×1)+1) , 11-й (=(5×2)+1) , … дочірній елемент.
:nth-child(5n+2): виберіть 2-й (=(5×0)+2) , 7-й (=(5×1)+2) , 12-й (=(5×2)+2) , … дочірній елемент.

Наприклад, :nth-child(2 of .highlight)вибирає другий відповідний елемент, який має .highlightклас. Інакше: з усіх дітей класу .highlightвибрати другого.

Це, на відміну від .highlight:nth-child(2)цього, вибирає елемент, який має клас .highlight , а також є другим дочірнім елементом.



// asd > i {} для всіх дочірніх i які йдуть в asd
// asd p + i {} для всіх і які йдуть після p в asd
// asd p~i {} для всіх i які є дочірними p в asd


// [type]{} так можна прописати стилі для тегів з атрbбутами type 
// [type$=’list’]{} значок долара вказує що всі теги з атрибутами type і значення яких закінчується на list будуть мати вказані стилі
// [type^=’list’]{} значок ^ вказує що всі теги з атрибутами type і значення яких починається на list будуть мати вказані стилі 
// * Для всіх в яких в середині є слово
// ~ для всіх в кого є окреме слово 


// Правило @supports позволяет проверить, поддерживает браузер ту или иную возможность, и на основе этого применить стили. Можно создавать составные условия с помощью логических операторов not, and, or.
// @supports (display: grid) {
//   div {
//     display: grid;
//   }
// }
// @supports not (display: grid) {
//   div {
//     float: right;
//   }
// }

// Псевдокласс :not задаёт правила стилей для элементов, которые не содержат указанный селектор.
// Псевдокласс :nth-child используется для добавления стиля к элементам на основе нумерации в дереве элементов
// Псевдокласс :placeholder-shown определяет стиль элемента <input> или <textarea>, который в данный момент отображает текст подсказки, заданной атрибутом placeholder.

