// як сховати модельне вікно при кліку за його межами
// 1 батьківський елемент модалки “підкладка ” робимо на весь екран і робимо його прозорим + на нього вішаємо onClick який ховатиме модалку.
// Підкладку можна робити не батьківським елементом а паралельно цей варіант кращий якщо в модальному вікні виділяємо текст і випадково виходимо за межі модального вікна і завершуємо клік то не буде спрацьовувати закриття модалки 
// 2 на боді або віндовс вішаємо прослуховувач який спрацює при всплитті яке буде при кліку. прослуховувач перевіряє чи кліу відбувся на модалці чи внутрішніх елементах модалки, якщо ні то він ховає модальне вікно


// таб індекс для фокусування щоб можна було переміщати  табом фокус на елементах. блюр щоб зняти фокус з елемента. 
// події фокусу не спливають. фокус ін щоб перевірити чи є фокус на певному елементі


// значення з інпута можна получити двома способами
// 1 через useStat повішавши на інпут прослуховувач і передавши в нього e.target.value
// 2 через const input = useRef() на інпут вішаємо силку input а значення получаємо input.current.value 

