// запустити проект на телефоні
Це запустить розробничий сервер, і ваш проект буде доступний за адресою http://localhost:3000/.

З'єднайте телефон і комп'ютер у спільну мережу: Переконайтеся, що ваш телефон і комп'ютер підключені до однієї Wi-Fi мережі або мають доступ до однієї локальної мережі.

Дізнайтеся IP-адресу комп'ютера: В терміналі на комп'ютері виконайте наступну команду, щоб дізнатися вашу IP-адресу:

bash
Copy code
ipconfig
Знайдіть рядок "IPv4 Address", що виглядає як "192.168.x.x". Це ваша IP-адреса.

Тестування з телефону: На своєму телефоні відкрийте браузер і введіть IP-адресу вашого комп'ютера за наступним форматом: http://<IP-адреса>:3000. Наприклад, http://192.168.x.x:3000. Тепер ви повинні бачити свій проект React на своєму телефоні.