Куки – это небольшие строки данных, которые хранятся непосредственно в браузере. 

для кожного сайту є окремий файл куки вони не контактують між собою. зберігаються в текстовому вигляді.
при кожному запросі get відправляється файл куки
куки можуть змінюватись і на сервері і вбравзері

куки в рсновному використовуються для авторизації

// Файл cookie - це частина даних (пари ключ-значення), яка зберігається на комп'ютері 
// користувача веб-браузером під час перегляду веб-сайту. Файли cookie створені для надійного 
// механізму веб-сайтів запам’ятовувати інформацію, що містить інформацію про стан, 
// або реєструвати активність користувача в режимі перегляду або перевіряти особу користувача.
alert( document.cookie ); // cookie1=value1; cookie2=value2;


имя и значение куки должны быть закодированы.
одно куки вмещает до 4kb данных, разрешается более 20 куки на сайт (зависит от браузера).