//...........................flat()
arr.flat();   // повертає новий масив, у якому всі елементи вставлених підмасивів були рекурсивно "піднятими" на заданий рівень глибини.

let arr = [1, 2, , 4, , 5].flat();    // [1, 2, 4, 5] - видаляє пусті елементи

let arr1 = [1, 2, [3, 4]];
arr1 = arr1.flat();     // [1, 2, 3, 4]

let arr2 = [1, 2, [3, 4, [5, 6]]];
arr2 = arr2.flat();    // [1, 2, 3, 4, [5, 6]]

let arr3 = [1, 2, [3, 4, [5, 6]]];
arr3 = arr3.flat(2);     // [1, 2, 3, 4, 5, 6]

let arr4 = [1, 2, [3, 4, [5, 6, [7, 8, [9, 10]]]]];
arr4 = arr4.flat(Infinity);    // [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
