Метод JSON.stringify()преобразовує значення JavaScript в строку JSON,


JSON.stringify({});                  // '{}'
JSON.stringify(true);                // 'true'
JSON.stringify('foo');               // '"foo"'
JSON.stringify([1, 'false', false]); // '[1,"false",false]'
JSON.stringify({ x: 5 });            // '{"x":5}'


const obj = {
    a: 3
}
obj.b = obj 
JSON.stringify(obj) // видасть помилку бо появляється циклічна залежність obj.b = obj 

при конвертації JSON.stringify() NaN i Infinity получиться null

JSON.stringify(obj,null,' ')  // третій параметер відповідає за форматування JSON строки якщо передати 
// 2 пробіла то всі вложені елементи починатимуться з нового рядка з двома пробілами можна передавати 
// інші символи або цифру яка означатиме кількість пробілів 

// Другий параметер це функція яка буде використовуватись для кожного елемента JSON обєкта


Якщо преобразуемый в строкі об'єкт має властивість з ім'ям toJSONі значенням властивостей,
 встановленим у функції, то цей метод toJSON()змінить стандартне поведінку перетворення
  в JSON: замість перетворення об'єкта буде використовуватися значення, яке повертається методом toJSON()

