Map – це колекція ключ/значення, як і Object. Але основна відмінність у тому, що Mapдозволяє використовувати ключі будь-якого типу.

Методи та властивості:

new Map()- Створює колекцію.
map.set(key, value)- Записує по ключу keyзначення value.
map.get(key)– повертає значення ключа або undefined, якщо ключ keyвідсутній.
map.has(key)– повертає true, якщо ключ keyприсутній у колекції, інакше false.
map.delete(key)- Видаляє елемент по ключу key.
map.clear()- Очищає колекцію від усіх елементів.
map.size– повертає кількість елементів.


Для перебору колекції Mapє 3 методи:

map.keys()– повертає об'єкт, що ітерується, за ключами,
map.values()– повертає об'єкт, що ітерується, за значеннями,
map.entries()– повертає об'єкт, що ітерується, по парах виду [ключ, значение],
 цей варіант використовується за замовчуванням в for..of.


 let recipeMap = new Map([
    ["огурец", 500],
    ["помидор", 350],
    ["лук",    50]
  ]);
  
  // перебор по ключам (овощи)
  for (let vegetable of recipeMap.keys()) {
    alert(vegetable); // огурец, помидор, лук
  }
  
  // перебор по значениям (числа)
  for (let amount of recipeMap.values()) {
    alert(amount); // 500, 350, 50
  }
  
  // перебор по элементам в формате [ключ, значение]
  for (let entry of recipeMap) { // то же самое, что и recipeMap.entries()
    alert(entry); // огурец,500 (и так далее)
  }