Об’єкти  Setдозволяють вам зберігати унікальні значення будь-якого типу, як примітиви
 , так і інші типи об’єктів.

 Об'єкти Setпредставляють колекції значень, за якими ви можете виконати обхід у порядку
  вставки елементів. Значення елемента  Set може бути присутнім тільки в одному екземплярі , 
  що забезпечує його унікальність у колекції  Set.


// -------------Set.prototype.size або asd.size
  Щоб дізнатися кількість елементів в Set, використовуйте  Set.prototype.size

  var mySet = new Set()
  mySet.add(1)    додати до обєкта

  mySet.has(1); // true перевірити чи є в обєкті
  
  mySet.delete(1); // удаляет 1 из set


  var myArr = Array.from(mySet)  //  перетворити set в масив
  [...mySet]    // перетворює  set в масив

  щоб перевірити чи в строці кожен елемент не повторюється можна зі строки створити Set і перевірити 
  return new Set(string).size === string.length
