//
event.preventDefault()

Метод preventDefault () інтерфейс Eventповідомляє Агент користувача , що якщо послуги не обробляються 
явно, його дію за умовчанням не виконується так, як зазвичай. stopPropagation ()Собіття продовжує 
розширюватися, як зазвичай, до тех пор, поки один із його обробників не викликає методи або , будь-який 
із яких відразу ж перекращає поширення stopImmediatePropagation ().
Як відмічено нижче, виклик методу preventDefault () для подій, не підлягає відміну, наприклад події,
 відправленого через EventTarget.dispatchEvent (), без вказівок cancelable: true не має ефекту.

//  
event.stopPropagation()

Спосіб stopPropagation()інтерфейсу Event запобігає подальшому поширенню поточної події на фазах 
захоплення та барботування. Однак це не запобігає будь-якій поведінці за замовчуванням; наприклад,
 кліки на посилання все ще обробляються. Якщо ви хочете зупинити таку поведінку, перегляньте
  preventDefault()метод. Це також не перешкоджає негайному поширенню на інші обробники подій.
   Якщо ви хочете зупинити їх, див stopImmediatePropagation().

stopImmediatePropagation

Метод stopImmediatePropagation()інтерфейсу Eventзапобігає виклику інших слухачів тієї ж події.
Якщо кілька слухачів приєднано до одного елемента для одного типу події, вони викликаються в тому 
порядку, в якому вони були додані. Якщо stopImmediatePropagation() буде викликано під час одного 
такого виклику, інші слухачі не будуть викликані.

