Чиста функція - це функція, яка:
За умови однакового входу(аргументів) завжди повертає той самий вихід.
Не викликає побічних ефектів. 


Функція — це процес, який приймає певні вхідні дані, які називаються аргументами , і виробляє
 деякий вихід, який називається поверненням значення . 

 Функції можуть служити наступним цілям:
Відображення: створіть певний результат на основі заданих вхідних даних. Функція відображає вхідні 
значення у вихідні значення.
Процедури: функція може бути викликана для виконання послідовності кроків. Послідовність відома як
 процедура, а програмування в цьому стилі відоме як процедурне програмування .
I/O: деякі функції існують для зв’язку з іншими частинами системи, наприклад, екран, сховище, системні
 журнали або мережа.