$('')   // в '' вказуємо селектор до елемента який нас цікавить
$('img[alt]')   // вибируться теги img в яких є атребут alt

const asd = $('.text').text().hide().show(), //  text() - витягує текс з тега з відповідним класом..... text('новий текст')- заміняє текст на новий
// hide().show() - показує і скриває тег -- hide(5000).show(5000) за період 5 секунд


width() и height(),    // витягує висоту і ширину обєкта.       width(200) и height(300) - міняє висоту і ширину

html()  // витягує html з відповідного тега    let asd = $('text').html('<p>новий текст</p>')- замінить всі теги на тег <р>

fadeOut() и fadeIn()   // скриває і показує елемент 
// fadeOut(2000, () => {}) и fadeIn(2000) за час вказаний першим параметром, 2 параметер функція яка спрацює після методу 

fadeTo(4000, 0.2) // скриває елесент за певний час і до певної прозрачності щоб він знову появився потрібно fadeTo(2000, 1)
// 3 параметер функція яка спрацює в кінці

slideUp(2000) и slideDown(2000)  .//ховає елемент до низу і показує 


attr() и removeAttr()  // let asd = $('text').attr('src') витягує атрибут з тега  attr("src", 'logo.pnj')  2 парамете заміняє його вміст
// якщо такого атрибута нема то метод attr його добавить
// removeAttr() видаляє атрибут


addClass('border') и removeClass('border') // додавання і видалення класу


css('color') // взнати css властивості тег.              css('color', 'red) 2 параметер міняє властивість


animate({'color': 'red', ...asd...}, 5000)     // анімаційно міняє scc властивості

before('<p>asdsdad</p>') after()  // добавляє тег перед\після вибраним елементом
append('<p>asdsdad</p>')  // добавляє тег вкінці вибраного елемента
prepend('<p>asdsdad</p>')  // добавляє тег спереду у вибраного елемента



each(function(){     // перебрати масив
    if($(this)) {

    }
}) и $(this)


clone() и remove()  // копіювання обєкта
let asd = $('text').remove() // елемент видалиться но змінну asd можна використати в іншому місті