Створення дерева Html 
https://yoksel.github.io/html-tree/


Провірка який тег можна вкладати в інший. Совмісність тегів
https://caninclude.glitch.me/


Розміщення html js css в форматі коду на сторінці
візуальне відображення коду на екрані
https://www.youtube.com/watch?v=YHWKjnFOOJg&list=PLOQDek48BpZG0kpcUAoy5Z5ZvZN1HYt3Z&index=3
https://highlightjs.org/





inputmode           // атрибут використовується в input and textarea щоб підказати бравзеру яку клавіатуру використовувати при спробі введення

accept  // атрибут в input type=file дозволяє відображати тільки ті типи файлів які потрібно accept='image/*, .gif, .web'

// забороняє роботам які роблять індексацію переходити за посиланням
<a rel="nofollow" />

// стилізація інпута react
const asd = useRef(null)

.hidden {
    width: 0;
    height: 0;
    opasiti: 0
}

const click = () => {
    asd.current.click()
}

<input className'hidden'  ref={asd} />
<button onClick={click}></button>

// щоб між 2  картинками не було пробіла потрібно в html  їх помістити в одному рядку.  2 варіант розмір тексту = 0  но це не точно


// Щоб відобразити якийсь символ   <h1 >  потрібно використати аперсант & і після нього &lt

// <s><s/> тег  перекреслюе все що в середині
// <u><u/> тег підкреслює все що в середині
// теги h1 h2 h3, strong,  em  використовуються при поіскових запросах


// <ol> нумеровані списки атребут start=’5’ вказує з якого числаначнеться нумерація
// атребут reverset вказує що нумерація начинається з кінця 

// <form> мае атребут enctype вказуе на спосіб кодіровки 
// атребут  metod  вказує на спосіб відправки
// атребут novalidate відміняє валідацію форми
// якщо інпуту задати type=’riset’ він буде очищати всю форму
// <label for=’name ’ >Імя<label/> <input id=’name’> при кліку на слово Імя в лейблі появиться курсор в інпуті
// атрибут maxlength вказує максимальну кількість символів в  інпуті
// арибут type=’serch’ в інпуті появиться хрестик для видалення
// атрибут type=’number’ min=’10’ max=’20’ інпут приймає тільки цифри від 10 до 20   
// в
// type=’range’ появиться повзунок step=’10’ вказує на величину крока
// pattern=’/D’ можна вводити тільки букви
// pattern=’[5-9]’ можна вводити тільки цифри від 5 до 9
// pattern=’/D/s/d’ можна вводити тільки букву пробіл і цифру
// pattern=’[0-9]{5}’ можна вводити тільки строго 5 цифр 
// якщо {5.} то не менше 5
// {1.5} від 1 до 5 символів можна вводити
// [0-9]+ можна вводити необмежену кількість цифрів


// <select> атрибут multyple дозволяє вибрати декілька варіантів
// 	<outgroup label=’’> обєднює в групи всередині select
// 	<option selected> буде відображатися той option в якому вказано selected


// Іноді може виникнути потреба, особливо під час розробки сторінки, масштабувати елемент, щоб він виглядав меншим або більшим.
// div {
//   zoom: 0.5;
// }

// У цьому прикладі показано, як вимкнути виділення тексту для певного елемента.
// .disable-text-selection{
//    -ms-user-select:none;
//    -moz-user-select:none;
//    -webkit-user-select:none;
//    -webkit-touch-callout: none;
//    -khtml-user-select: none;
//     user-select:none;
// }

// У css у нас є ::selectionселектор псевдоелементів, за допомогою якого ми можемо змінити колір виділення тексту за замовчуванням.
// p::selection{
//     color: pink;
//     background: white;
// }

// p::-moz-selection {
//     color: pink;
//     background: white;  /* firefox code */
// }




