v-if
Приймає: any
Використання:Здійснює відмальовування елемента, тільки якщо вираз, що передається, істинно. При зміні значення виразу на протилежне, елемент і компоненти і директиви, що містяться в ньому, знищуються/перетворюються. Якщо елемент — <template>, замість нього буде відображено його вміст.

v-show
Приймає: any
Використання: Перемикає CSS-властивість displayелемента, залежно від того, чи істинно зазначений вираз.


// v-ifмає вищі витрати на перемикання, тоді як v-showмає вищі початкові витрати на рендеринг.
// Тому віддавайте перевагу, v-showякщо вам потрібно щось перемикати дуже часто, і вважайте v-ifза краще,
// якщо умова навряд чи зміниться під час виконання.

// v-show не підтримує <template> і не працює з ним v-else.

<!-- 1. -->
<div v-if="type === 'A'">A</div>         // якщо умова не виконується то div не відображається 
<div v-else-if="type === 'B'">B</div>      // і перевіряється наступна. якщо всі не підходять то виконаєтьсяя else
<div v-else-if="type === 'C'">C</div>
<div v-else>D</div>

<!-- 2. -->
<h1 v-show="ok">Hello!</h1>   // виконається якщо true