watch

б'єкт, ключі якого - висловлювання для спостереження, а значення - коллбеки, 
що викликаються при їх зміні. Значення також можуть бути рядками з іменами 
методів або об'єктами, що містять додаткові опції. 
Примірник Vue викличе $watch()відповідний кожному ключу об'єкта під час свого створення.


var vm = new Vue({
  data: {
    a: 1,
    b: 2,
    c: 3,
    d: 4,
    e: {
      f: {
        g: 5
      }
    }
  },
  watch: {            
    a: function (val, oldVal) {
      console.log('новое значение: %s, старое значение: %s', val, oldVal)
    },

    // строка с именем метода:
    b: 'someMethod',

    // Коллбэк будет вызываться каждый раз, когда изменяется любое из свойств
    // наблюдаемого объекта, независимо от глубины их вложенности
    c: {
      handler: function (val, oldVal) { /* ... */ },
      deep: true
    },

    // коллбэк будет вызван сразу же после начала наблюдения
    d: {
      handler: 'someMethod',
      immediate: true
    },

    // можно передать массив коллбэков, они будут вызываться один за одним
    e: [
      'handle1',
      function handle2 (val, oldVal) { /* ... */ },
      {
        handler: function handle3 (val, oldVal) { /* ... */ },
        /* ... */
      }
    ],

    // отслеживание значения `vm.e.f`: {g: 5}
    'e.f': function (val, oldVal) { /* ... */ }
  }
})
vm.a = 2 // => новое значение: 2, старое значение: 1
